# helpful command-line tools
brew "fd"
brew "fzf"
brew "httpie"
brew "jq"
brew "ripgrep"
brew "tealdeer"
brew "tree"
brew "trash"
brew "wget"
brew "bat"
brew "difftastic"

# helpful command-line applications
brew "nmap"
brew "vim"
brew "glances"

# productivity applications
cask "flux" if OS.mac?
cask "keka" if OS.mac?
cask "firefox"

# programming applications
cask "iterm2" if OS.mac?

tap "homebrew/cask-fonts"
cask "font-meslo-lg-nerd-font" if OS.mac?

# user applications
cask "spotify"
cask "bitwarden"

